app/controllers/sessions_controller.rb

  def create
    auth = request.env["omniauth.auth"]
    user = User.find_by_provider_and_uid(auth["provider"], auth["uid"]) || User.create_with_omniauth(auth)
---
INSERT INTO "users" ("created_at", "name", "provider", "uid", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Wed, 09 May 2012 07:10:54 UTC +00:00], ["name", "かとりょー"], ["provider", "twitter"], ["uid", "20364161"], ["updated_at", Wed, 09 May 2012 07:10:54 UTC +00:00]]
SELECT "users".* FROM "users" WHERE "users"."provider" = 'twitter' AND "users"."uid" = '20364161' LIMIT 1